In [1]:
import pandas as pd
import seaborn as sns

In [2]:
titanic = sns.load_dataset("titanic")

In [7]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [4]:
titanic.pivot_table("survived", index = "sex", columns = "class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

### Adding one more dimension

In [5]:
age_brakets = pd.cut(titanic["age"], (0, 18, 50, 80))

In [6]:
titanic.pivot_table("survived", 
                    index = ["sex", age_brakets],
                    columns = "class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 50]  0.967213  0.912281  0.413793
       (50, 80]  1.000000  0.666667  1.000000
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 50]  0.442857  0.069444  0.139896
       (50, 80]  0.192308  0.083333  0.000000

### Adding another dimension

In [22]:
fare_brakets = pd.qcut(titanic["fare"], 2)

In [23]:
titanic.pivot_table("survived",
                   index = ["sex", age_brakets, fare_brakets],
                   columns = ["class"])

class                                 First    Second     Third
sex    age      fare
female (0, 18]  (-0.001, 14.454]        NaN  1.000000  0.714286
                (14.454, 512.329]  0.909091  1.000000  0.318182
       (18, 50] (-0.001, 14.454]        NaN  0.916667  0.428571
                (14.454, 512.329]  0.967213  0.909091  0.391304
       (50, 80] (-0.001, 14.454]        NaN  0.000000  1.000000
                (14.454, 512.329]  1.000000  1.000000       NaN
male   (0, 18]  (-0.001, 14.454]        NaN  0.000000  0.260870
                (14.454, 512.329]  0.800000  0.818182  0.178571
       (18, 50] (-0.001, 14.454]   0.000000  0.095238  0.131737
                (14.454, 512.329]  0.469697  0.033333  0.192308
       (50, 80] (-0.001, 14.454]        NaN  0.111111  0.000000
                (14.454, 512.329]  0.192308  0.000000       NaN